# DetailsOfNestedGroupsLost Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..DetailsOfNestedGroupsLost Property
BuiltInFailures..::..GroupFailures Class See Also
---
Details will be deleted if they reference group members being ungrouped in other instances of this containing group.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DetailsOfNestedGroupsLost { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DetailsOfNestedGroupsLost As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DetailsOfNestedGroupsLost {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace